# think globaly and act locally let explore the supplimentry list of Gsu 2020 list

In [1]:
# importing  pandas library for data frame 
import pandas as dframe

In [4]:
data = dframe.read_csv('dataset/Admitted2020.csv')

In [5]:
data.head()

          JAMB                  NAME  SEX  CUS
0  20029586CF   OBADIAH SAMUEL GANAH    M   ZO
1  20029586CF   OBADIAH SAMUEL GANAH    M   ZO
2  20029672HA   FARUK ABUBAKAR AJIYA    M   MC
3  20029672HA   FARUK ABUBAKAR AJIYA    M   MC
4  20047201BF        ISHAKU CAROLINE    F   BT

In [7]:
data.describe()

               JAMB            NAME   SEX    CUS
count          2895             2895  2894  2894
unique         1448             1435     2    40
top     20822091EF   ABUBAKAR USMAN     M     BT
freq              6                8  1538   253

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2895 entries, 0 to 2894
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   JAMB    2895 non-null   object
 1   NAME    2895 non-null   object
 2   SEX     2894 non-null   object
 3   CUS     2894 non-null   object
dtypes: object(4)
memory usage: 90.6+ KB

In [9]:
data.columns

Index(['JAMB', 'NAME ', 'SEX ', 'CUS'], dtype='object')

In [10]:
data.shape

(2895, 4)

In [15]:
data.tail()

             JAMB                     NAME  SEX  CUS
2890  22360431CA        ISHAKU DANIEL DIRE    M   BC
2891  22360602CA   SULAIMAN KHADIJAH ALIYU    M   BC
2892  22360602CA   SULAIMAN KHADIJAH ALIYU    F   BC
2893  22360767FA           HASSAN MAIKWADA    F   BC
2894  22360767FA           HASSAN MAIKWADA    M   PA

In [16]:
data['JAMB']

0       20029586CF
1       20029586CF
2       20029672HA
3       20029672HA
4       20047201BF
           ...
2890    22360431CA
2891    22360602CA
2892    22360602CA
2893    22360767FA
2894    22360767FA
Name: JAMB, Length: 2895, dtype: object

In [21]:
data['CUS']

0       ZO
1       ZO
2       MC
3       MC
4       BT
        ..
2890    BC
2891    BC
2892    BC
2893    BC
2894    PA
Name: CUS, Length: 2895, dtype: object